windDrivenRainFoam/validation/cubicBuildingRain/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do NOT include patch 'defaultFaces' - this is a reserved name

// Patches to create
patches
(
    {
        // Name of new patch
        name building;

        // Type of new patch
        patchInfo
        {
            type wall;
        }

        // How to construct: either from patches or set
        constructFrom set;

        // If constructFrom = set : name of faceSet
        set buildingFaces;
    }
);

// ************************************************************************* //