windDrivenRainFoam/validation/cubicBuildingRain/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        Uref            10;
        Zref            10;
        zDir            (0 0 1);
        flowDir         (1 0 0);
        z0              0.03;
        d               0;
        value           uniform (10 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    building
    {
        type            noSlip;
    }
    ground
    {
        type            noSlip;
    }
    top
    {
        type            slip;
    }
    sideY1
    {
        type            symmetryPlane;
    }
    sideY2
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //